src/test/testtool/RaadpleegMetBurgerservicenummer/06/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301">NEDGR</organisatie>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">NEDMAG_VnA</applicatie>
		</StUF:zender>
		<StUF:ontvanger>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301">0518</organisatie>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">TOP</applicatie>
		</StUF:ontvanger>
		<StUF:tijdstipBericht>20241014193101434</StUF:tijdstipBericht>
		<StUF:crossRefnummer>8f8d0ebf-c1bd-45c3-9443-69a14df44782</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
		<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS">
			<inp.bsn xmlns="http://www.egem.nl/StUF/sector/bg/0310">555555021</inp.bsn>
			<geslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">Verhuistest</geslachtsnaam>
			<voorvoegselGeslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">van den</voorvoegselGeslachtsnaam>
			<voorletters xmlns="http://www.egem.nl/StUF/sector/bg/0310">K.</voorletters>
			<voornamen xmlns="http://www.egem.nl/StUF/sector/bg/0310">Kees</voornamen>
			<aanduidingNaamgebruik xmlns="http://www.egem.nl/StUF/sector/bg/0310">E</aanduidingNaamgebruik>
			<geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsaanduiding xmlns="http://www.egem.nl/StUF/sector/bg/0310">M</geslachtsaanduiding>
			<geboortedatum xmlns="http://www.egem.nl/StUF/sector/bg/0310">20020701</geboortedatum>
			<inp.geboorteplaats xmlns="http://www.egem.nl/StUF/sector/bg/0310">Hellevoetsluis</inp.geboorteplaats>
			<inp.geboorteLand xmlns="http://www.egem.nl/StUF/sector/bg/0310">6030</inp.geboorteLand>
			<overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.verblijftIn StUF:entiteittype="NPSTGO" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="TGO">
					<adresAanduidingGrp>
						<wpl.woonplaatsNaam>'s-Gravenhage</wpl.woonplaatsNaam>
						<aoa.woonplaatsWaarinGelegen>
							<wpl.woonplaatsNaam>'s-Gravenhage</wpl.woonplaatsNaam>
						</aoa.woonplaatsWaarinGelegen>
						<gor.openbareRuimteNaam>Laan van Nieuw-Oost-Indië</gor.openbareRuimteNaam>
						<aoa.postcode>2593BL</aoa.postcode>
						<aoa.huisnummer>101</aoa.huisnummer>
						<aoa.huisletter>A</aoa.huisletter>
						<aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
					</adresAanduidingGrp>
				</gerelateerde>
			</inp.verblijftIn>
			<verblijfsadres xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<wpl.woonplaatsNaam>'s-Gravenhage</wpl.woonplaatsNaam>
				<aoa.woonplaatsWaarinGelegen>
					<wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
				</aoa.woonplaatsWaarinGelegen>
				<gor.openbareRuimteNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<aoa.postcode>2593BL</aoa.postcode>
				<aoa.huisnummer>101</aoa.huisnummer>
				<aoa.huisletter>A</aoa.huisletter>
				<aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<inp.locatiebeschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			</verblijfsadres>
			<sub.correspondentieAdres xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.telefoonnummer xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.emailadres xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.burgerlijkeStaat xmlns="http://www.egem.nl/StUF/sector/bg/0310">1</inp.burgerlijkeStaat>
			<inp.gemeenteVanInschrijving xmlns="http://www.egem.nl/StUF/sector/bg/0310">0518</inp.gemeenteVanInschrijving>
			<ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="NAT">
					<code>0001</code>
				</gerelateerde>
				<inp.datumVerkrijging>20020701</inp.datumVerkrijging>
			</inp.heeftAlsNationaliteit>
			<inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="NPS">
					<geslachtsnaam>Verhuistest</geslachtsnaam>
					<voorvoegselGeslachtsnaam>van den</voorvoegselGeslachtsnaam>
					<voorletters>C.</voorletters>
					<voornamen>Carolina</voornamen>
					<geslachtsaanduiding>V</geslachtsaanduiding>
					<geboortedatum>19710823</geboortedatum>
					<inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				</gerelateerde>
			</inp.heeftAlsOuders>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>